Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum
The available enumerator types.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum.ALL_SELECTED
This selects all the user selected objects.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum.ALL_OBJECTS
This selects all the objects.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum.ALL_OBJECTS_WITH_TYPE
This selects all the objects with the given type as the "subtype".

Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum.SUB_ANALYSIS_PARTS_OF_ANALYSIS_PART
Sub analysis parts of analysis part.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum.MAIN_ANALYSIS_PARTS_OF_ANALYSIS_PART
Main analysis parts of analysis part.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum.ANALYSIS_PARTS_BY_NODE
Analysis parts connected to node.

Tekla.Structures.Analysis.AnalysisObjectEnumerator.AnalysisEnumeratorTypeEnum.ANALYSIS_NODELINKS_BY_NODE
Analysis node links connected to node.